<template>
  <div id="newdetail" class="index_box">
    <div class="top_wrap">
           <div class="topImg">
             <img src="../../../static/img/topimg.png" alt="">
           </div>
           <div class="topmark"></div>
    </div>
    <div class="navTitle">
      <p>{{navTitle}} <span>{{games}}</span></p>
      
    </div>
    <div class="content">
      <div class="crumbs">
         <img src="../../../static/img/gap.png" alt="" />
         <span v-on:click="gotoIndex()">{{indexs}}</span>
         >
         <span v-on:click="gotoConpany()">{{crumbs}}</span>
         
      </div>
      <div class="airtcle">
        <p class="air_title">
          {{airtcleData.title}}
        </p>
        <p class="air_time">
          {{airtcleData.time}}
          
        </p>
        <div class="share" v-if="share">
          <!-- 分享 -->
          <span class='st_sharethis_large' displayText='ShareThis'></span>
          <span class='st_facebook_large' displayText='Facebook'></span>
          <span class='st_twitter_large' displayText='Tweet'></span>
          <span class='st_linkedin_large' displayText='LinkedIn'></span>
          <span class='st_email_large' displayText='Email'></span> 
        </div>

        <div class="air_detail" v-html="airtcleData.content">
        </div>
      </div>
      <BackTop ></BackTop><!-- 返回顶部 -->
    </div>

  </div>
</template>

<script>

export default {
  data () {
    return {
      share:true,
      crumbs:'公司动态',
      indexs:'首页',
      navTitle:'新闻详情',
      games:'News details',
      airtcleData:{
        id:'1',
        title:'年度首开新服 永恒魔法“二〇一八”预约开启',
        time:'2015-05-01',
        content:'魔幻网游革新之作《永恒魔法》即将于3月16日迎来年度首服“二〇一八”，全新内容“全职觉醒”隆重开启。现在参与新服预约，即可获得多重预约好礼，还可提前掌握更多全新内容爆料。 　　《永恒魔法》新服“二〇一八”预约 　　新服开启时间：3月16日中午12:00 【全新内容“全职觉醒”3月16日公测】 新服预约火热进行 年度首服备受期待 　　《永恒魔法》狗年年度首服的服务器名字最终敲定为“二〇一八”，一改以往的四字成语式起名，旨在打造年度第一爽服概念。 【2018年度首服“二〇一八”预约开启】 人物觉醒技能：逆天双套技能首曝 　　本次全新内容，《永恒魔法》将为副本战斗融入全职业必杀技系统，所有职业将配备双套技能体系，玩家可以手握一套终极大招技能！在战斗中开启觉醒状态，当前技能面板将完全换新，爆发逆天的战斗力。 【觉醒技能】 　　首先，每个职业将拥有各自的觉醒能量槽，在副本中觉醒能量会逐渐增加，累积到100%后玩家可以按指定按键开启觉醒状态。觉醒之后玩家身上将会有觉醒特效出现，同时基础技能面板将按不同的天赋被替换成全新的不同技能，全职业共计觉醒近50个技能。觉醒期间，玩家战斗力将有爆炸性的提高，同时会持续扣除能量值。当能量值被扣除到0时，觉醒结束，技能回复原来的状态。 新竞技玩法：超凡竞技场 　　本次全新内容《永恒魔法》将开放正式PVP竞技场。玩家将置身与罗马斗兽场般的圆形战场，以3V3形式进行限时对抗，规定时间内全数击败对方或造成伤害最高的队伍获得胜利。同时竞技场采用天梯排位赛形式，分为新锐、青铜、白银、黄金、钻石、大师、传说七等段位，玩家在战斗中赢取积分提升段位，每等段位设置不同的奖品。 【竞技场场景】 【竞技场战斗】 魔幻家园系统首曝 　　3月的内容大更新，将开辟新的地图“仲夏岛”，并推出一项重磅休闲新玩法——魔幻家园。在全新地图中，玩家可通过建造房屋、制造家具等活动定制专属的世外桃源；也可进行花卉种植、图鉴收集，打造美轮美奂的私家园林；玩家还可以邀请好友做客，互动社交，积攒人气。 【全新地图“仲夏岛”】 　　此外，魔幻家园融入了《永恒魔法》的特色奇遇系统，装饰家园可以触发大量的随机事件，为玩家带来不确定的剧情及奖励/惩罚，开启另一段有趣休闲的生活。 　　一个天使与巨龙并存的魔幻大世界，一场热血且激燃的非凡战斗！魔幻RPG《永恒魔法》全新内容即将开启，现在预约新服“二〇一八”，邀你体验不一样的魔幻盛宴。 关于《永恒魔法》 　　《永恒魔法》是多益网络最新研发的纯正魔幻冒险RPG，开启一个巨龙与天使并存的魔幻史诗世界。《永恒魔法》包含影视级流光视觉画面、6大职业多姿态自由切换、组合式变形定制技能、变幻莫测的动态副本、40人V40人的热血大战场、奇幻萌动的宠物等特色。玩家可享受与好友兄弟，一起战斗竞技、热血开荒、探索世界的乐趣！魔幻网游革新之作《永恒魔法》即将于3月16日迎来年度首服“二〇一八”，全新内容“全职觉醒”隆重开启。现在参与新服预约，即可获得多重预约好礼，还可提前掌握更多全新内容爆料。 　　《永恒魔法》新服“二〇一八”预约 　　新服开启时间：3月16日中午12:00 【全新内容“全职觉醒”3月16日公测】 新服预约火热进行 年度首服备受期待 　　《永恒魔法》狗年年度首服的服务器名字最终敲定为“二〇一八”，一改以往的四字成语式起名，旨在打造年度第一爽服概念。 【2018年度首服“二〇一八”预约开启】 人物觉醒技能：逆天双套技能首曝 　　本次全新内容，《永恒魔法》将为副本战斗融入全职业必杀技系统，所有职业将配备双套技能体系，玩家可以手握一套终极大招技能！在战斗中开启觉醒状态，当前技能面板将完全换新，爆发逆天的战斗力。 【觉醒技能】 　　首先，每个职业将拥有各自的觉醒能量槽，在副本中觉醒能量会逐渐增加，累积到100%后玩家可以按指定按键开启觉醒状态。觉醒之后玩家身上将会有觉醒特效出现，同时基础技能面板将按不同的天赋被替换成全新的不同技能，全职业共计觉醒近50个技能。觉醒期间，玩家战斗力将有爆炸性的提高，同时会持续扣除能量值。当能量值被扣除到0时，觉醒结束，技能回复原来的状态。 新竞技玩法：超凡竞技场 　　本次全新内容《永恒魔法》将开放正式PVP竞技场。玩家将置身与罗马斗兽场般的圆形战场，以3V3形式进行限时对抗，规定时间内全数击败对方或造成伤害最高的队伍获得胜利。同时竞技场采用天梯排位赛形式，分为新锐、青铜、白银、黄金、钻石、大师、传说七等段位，玩家在战斗中赢取积分提升段位，每等段位设置不同的奖品。 【竞技场场景】 【竞技场战斗】 魔幻家园系统首曝 　　3月的内容大更新，将开辟新的地图“仲夏岛”，并推出一项重磅休闲新玩法——魔幻家园。在全新地图中，玩家可通过建造房屋、制造家具等活动定制专属的世外桃源；也可进行花卉种植、图鉴收集，打造美轮美奂的私家园林；玩家还可以邀请好友做客，互动社交，积攒人气。 【全新地图“仲夏岛”】 　　此外，魔幻家园融入了《永恒魔法》的特色奇遇系统，装饰家园可以触发大量的随机事件，为玩家带来不确定的剧情及奖励/惩罚，开启另一段有趣休闲的生活。 　　一个天使与巨龙并存的魔幻大世界，一场热血且激燃的非凡战斗！魔幻RPG《永恒魔法》全新内容即将开启，现在预约新服“二〇一八”，邀你体验不一样的魔幻盛宴。 关于《永恒魔法》 　　《永恒魔法》是多益网络最新研发的纯正魔幻冒险RPG，开启一个巨龙与天使并存的魔幻史诗世界。《永恒魔法》包含影视级流光视觉画面、6大职业多姿态自由切换、组合式变形定制技能、变幻莫测的动态副本、40人V40人的热血大战场、奇幻萌动的宠物等特色。玩家可享受与好友兄弟，一起战斗竞技、热血开荒、探索世界的乐趣！魔幻网游革新之作《永恒魔法》即将于3月16日迎来年度首服“二〇一八”，全新内容“全职觉醒”隆重开启。现在参与新服预约，即可获得多重预约好礼，还可提前掌握更多全新内容爆料。 　　《永恒魔法》新服“二〇一八”预约 　　新服开启时间：3月16日中午12:00 【全新内容“全职觉醒”3月16日公测】 新服预约火热进行 年度首服备受期待 　　《永恒魔法》狗年年度首服的服务器名字最终敲定为“二〇一八”，一改以往的四字成语式起名，旨在打造年度第一爽服概念。 【2018年度首服“二〇一八”预约开启】 人物觉醒技能：逆天双套技能首曝 　　本次全新内容，《永恒魔法》将为副本战斗融入全职业必杀技系统，所有职业将配备双套技能体系，玩家可以手握一套终极大招技能！在战斗中开启觉醒状态，当前技能面板将完全换新，爆发逆天的战斗力。 【觉醒技能】 　　首先，每个职业将拥有各自的觉醒能量槽，在副本中觉醒能量会逐渐增加，累积到100%后玩家可以按指定按键开启觉醒状态。觉醒之后玩家身上将会有觉醒特效出现，同时基础技能面板将按不同的天赋被替换成全新的不同技能，全职业共计觉醒近50个技能。觉醒期间，玩家战斗力将有爆炸性的提高，同时会持续扣除能量值。当能量值被扣除到0时，觉醒结束，技能回复原来的状态。 新竞技玩法：超凡竞技场 　　本次全新内容《永恒魔法》将开放正式PVP竞技场。玩家将置身与罗马斗兽场般的圆形战场，以3V3形式进行限时对抗，规定时间内全数击败对方或造成伤害最高的队伍获得胜利。同时竞技场采用天梯排位赛形式，分为新锐、青铜、白银、黄金、钻石、大师、传说七等段位，玩家在战斗中赢取积分提升段位，每等段位设置不同的奖品。 【竞技场场景】 【竞技场战斗】 魔幻家园系统首曝 　　3月的内容大更新，将开辟新的地图“仲夏岛”，并推出一项重磅休闲新玩法——魔幻家园。在全新地图中，玩家可通过建造房屋、制造家具等活动定制专属的世外桃源；也可进行花卉种植、图鉴收集，打造美轮美奂的私家园林；玩家还可以邀请好友做客，互动社交，积攒人气。 【全新地图“仲夏岛”】 　　此外，魔幻家园融入了《永恒魔法》的特色奇遇系统，装饰家园可以触发大量的随机事件，为玩家带来不确定的剧情及奖励/惩罚，开启另一段有趣休闲的生活。 　　一个天使与巨龙并存的魔幻大世界，一场热血且激燃的非凡战斗！魔幻RPG《永恒魔法》全新内容即将开启，现在预约新服“二〇一八”，邀你体验不一样的魔幻盛宴。 关于《永恒魔法》 　　《永恒魔法》是多益网络最新研发的纯正魔幻冒险RPG，开启一个巨龙与天使并存的魔幻史诗世界。《永恒魔法》包含影视级流光视觉画面、6大职业多姿态自由切换、组合式变形定制技能、变幻莫测的动态副本、40人V40人的热血大战场、奇幻萌动的宠物等特色。玩家可享受与好友兄弟，一起战斗竞技、热血开荒、探索世界的乐趣！魔幻网游革新之作《永恒魔法》即将于3月16日迎来年度首服“二〇一八”，全新内容“全职觉醒”隆重开启。现在参与新服预约，即可获得多重预约好礼，还可提前掌握更多全新内容爆料。 　　《永恒魔法》新服“二〇一八”预约 　　新服开启时间：3月16日中午12:00 【全新内容“全职觉醒”3月16日公测】 新服预约火热进行 年度首服备受期待 　　《永恒魔法》狗年年度首服的服务器名字最终敲定为“二〇一八”，一改以往的四字成语式起名，旨在打造年度第一爽服概念。 【2018年度首服“二〇一八”预约开启】 人物觉醒技能：逆天双套技能首曝 　　本次全新内容，《永恒魔法》将为副本战斗融入全职业必杀技系统，所有职业将配备双套技能体系，玩家可以手握一套终极大招技能！在战斗中开启觉醒状态，当前技能面板将完全换新，爆发逆天的战斗力。 【觉醒技能】 　　首先，每个职业将拥有各自的觉醒能量槽，在副本中觉醒能量会逐渐增加，累积到100%后玩家可以按指定按键开启觉醒状态。觉醒之后玩家身上将会有觉醒特效出现，同时基础技能面板将按不同的天赋被替换成全新的不同技能，全职业共计觉醒近50个技能。觉醒期间，玩家战斗力将有爆炸性的提高，同时会持续扣除能量值。当能量值被扣除到0时，觉醒结束，技能回复原来的状态。 新竞技玩法：超凡竞技场 　　本次全新内容《永恒魔法》将开放正式PVP竞技场。玩家将置身与罗马斗兽场般的圆形战场，以3V3形式进行限时对抗，规定时间内全数击败对方或造成伤害最高的队伍获得胜利。同时竞技场采用天梯排位赛形式，分为新锐、青铜、白银、黄金、钻石、大师、传说七等段位，玩家在战斗中赢取积分提升段位，每等段位设置不同的奖品。 【竞技场场景】 【竞技场战斗】 魔幻家园系统首曝 　　3月的内容大更新，将开辟新的地图“仲夏岛”，并推出一项重磅休闲新玩法——魔幻家园。在全新地图中，玩家可通过建造房屋、制造家具等活动定制专属的世外桃源；也可进行花卉种植、图鉴收集，打造美轮美奂的私家园林；玩家还可以邀请好友做客，互动社交，积攒人气。 【全新地图“仲夏岛”】 　　此外，魔幻家园融入了《永恒魔法》的特色奇遇系统，装饰家园可以触发大量的随机事件，为玩家带来不确定的剧情及奖励/惩罚，开启另一段有趣休闲的生活。 　　一个天使与巨龙并存的魔幻大世界，一场热血且激燃的非凡战斗！魔幻RPG《永恒魔法》全新内容即将开启，现在预约新服“二〇一八”，邀你体验不一样的魔幻盛宴。 关于《永恒魔法》 　　《永恒魔法》是多益网络最新研发的纯正魔幻冒险RPG，开启一个巨龙与天使并存的魔幻史诗世界。《永恒魔法》包含影视级流光视觉画面、6大职业多姿态自由切换、组合式变形定制技能、变幻莫测的动态副本、40人V40人的热血大战场、奇幻萌动的宠物等特色。玩家可享受与好友兄弟，一起战斗竞技、热血开荒、探索世界的乐趣！'
      }
    }
  },
  mounted:function(){ 
  },
  updated:function(){

  },
  created: function(){
  },
  methods:{ 
    gotoConpany(){
      this.$router.push({path:'/company/newlist'})
    },
    gotoIndex(){
      this.$router.push({path:'/'})
    }
    
  }
}
</script>
<style scoped>
#newdetail .content{
  position: relative;
  width: 1200px;
  margin:0 auto;
}
#newdetail .navTitle{
  width: 100%;
  height: 90px;
  border-bottom:1px solid #F08200;
}
#newdetail .navTitle p{
  width: 1200px;
  line-height: 120px;
  font-size: 24px;
  color: #f08200;
  margin:0 auto;
  font-weight: bold;
  cursor: default;
}
#newdetail .navTitle p span{
  font-size: 16px;
  color: #999;
  font-weight: normal;
}   
#newdetail .content{
  position: relative;
}
#newdetail .content .crumbs{
  position: absolute;
  right: 0;
  top:-35px;
  cursor: default;
}
#newdetail .content .crumbs span{
  cursor:pointer;
  font-size: 16px;
  display: inline-block;
  margin:0 8px;
  color: #999;
  font-weight: normal;
}
#newdetail .content .airtcle{
  width: 1000px;
  margin:0 auto;
  position: relative;
}
#newdetail .content .airtcle .air_title{
  text-align: center;
  font-size: 24px;
  color: #333;
  padding-top: 40px
}
#newdetail .content .airtcle .air_time{
  text-align: center;
  color: #999;
  font-size: 18px;
  margin:16px 0 29px 0px;
}
#newdetail .content .airtcle .share{
  position: absolute;
  right: 0;
  top:70px;
}
#newdetail .content .airtcle .air_detail{
  font-size: 16px;
  color: #333;
  text-indent: 2em;
  margin-bottom: 100px
}
#newdetail .content .airtcle .air_detail p{
  text-indent: 2em
}
</style>
